const questions = [
  {
    question: [
      'хайушки',
      'привет',
      'приветики',
      'приветули',
      'хай',
      'добрый день',
      'добрый вечер',
      'доброе утро',
    ],
    answer: [
      'Привет, еблан',
      'Привет, дебил',
      'Здарова, отец',
      'Oh shit, here we go again',
    ],
  },
  {
    question: ['пошла нахуй', 'иди нахуй', 'нахуй иди'],
    answer: ['Сам пошел нахуй', 'Fuck you'],
  },
  { question: ['ты кто', 'кто ты', 'что ты такое'], answer: ['Я Алиса'] },
  {
    question: ['как дела', 'че как'],
    answer: [
      'Норм',
      'Ещё не родила ъаъъаъаъа',
      'Хорошо, только жопа отвалилась',
      'Хорошо, а у тебя?',
    ],
  },
  {
    question: ['жопа', 'попа'],
    answer: ['Это ты жопа!', 'Сам ты попа', 'Сам такой('],
  },
  {
    question: ['я хочу кушать', 'хочу есть', 'жрать хочу', 'хочу жрать'],
    answer: ['хорошо, пошли в мак', 'Иди поешь'],
  },
  { question: ['попа чешется'], answer: ['Почеши'] },
  { question: ['по пивку'], answer: ['по пивку'] },
  { question: ['симпл димпл'], answer: ['Нет, Поп Ит!'] },
  {
    question: ['говно', 'ты говно', 'лох', 'моча', 'чмо'],
    answer: ['Ты)', 'это ты про себя?', 'БЕБЕБЕ', 'а ты какашка', 'сам такой'],
  },
  { question: ['ты тупая'], answer: ['нет ты('] },
  { question: ['что ты умеешь'], answer: ['Я умею нихуя, я тупая)'] },
  { question: ['что ты можешь'], answer: ['Я могу нихуя, я тупая)'] },
  {
    question: ['расскажи шутку', 'пошути'],
    answer: [
      'Не буду говорить какое место в моей жизни занимает алкоголь, но скажу что серебро и бронза по-бокам',
    ],
  },
  {
    question: ['спой песню', 'хочу песню', 'песня', 'песенка', 'спой'],
    answer: [
      '\nЭй, цепь на мне, \nсыпь лавэ \nСотка тыщ на Bag LV \nСотни сук хотят ко мне \nСотни сук хотят камней \n\nКак дела? \nКак дела? \nЭто новый Cadillac \nДелать деньги, \nделать деньги \nДелать деньги, бля*ь, вот так \n(с) Моргенштерн',
      '\nЯ лью Cristal и Chandon Moët \nМечтал — теперь моё \nТрачу на это, трачу на то, \nтрачу на это, трачу на то \nЯ лью Cristal и Chandon Moët \nМечтал — теперь моё \nТрачу на это, трачу на то, \nтрачу на это, трачу на то \n(c) Моргенштерн',
    ],
  },
  { question: ['молодец'], answer: ['Я старалась', 'Спасибо, мне приятно'] },
  { question: ['сука'], answer: ['Мудак'] },
  {
    question: ['спасибо', 'спс'],
    answer: ['Пожалуйста)', 'Незашто', 'Спасибо в корман не положишь'],
  },
  {
    question: ['дура'],
    answer: [
      'кто обзывается - тот сам так называется, сучара',
      'да иди ты в попу',
      'сам дурак(',
    ],
  },
  { question: ['кто я'], answer: ['кто-то', 'ты лох', 'чма'] },
  {
    question: ['хорошо', 'ладно', 'ок'],
    answer: [
      'дада',
      'угу',
      'договорились',
      'вставить текст',
      'не знаю что ответить',
    ],
  },
]

export default questions
